In [1]:
!pip install pandas

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pandas in c:\users\debjit\appdata\roaming\python\python36\site-packages (1.1.5)
Requirement already satisfied: pytz>=2017.2 in c:\program files\python36\lib\site-packages (from pandas) (2022.1)
Requirement already satisfied: numpy>=1.15.4 in c:\users\debjit\appdata\roaming\python\python36\site-packages (from pandas) (1.19.3)
Requirement already satisfied: python-dateutil>=2.7.3 in c:\program files\python36\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: six>=1.5 in c:\program files\python36\lib\site-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)

In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
df=pd.DataFrame()

# pandas create data frame

In [4]:
print(df)

Empty DataFrame
Columns: []
Index: []

In [5]:
df1=pd.DataFrame([[1,2,3,4],[5,6,7,8],[8,9,10,11],[23,45,67,89]])

In [6]:
df1

    0   1   2   3
0   1   2   3   4
1   5   6   7   8
2   8   9  10  11
3  23  45  67  89

In [7]:
df1.head(2)

   0  1  2  3
0  1  2  3  4
1  5  6  7  8

In [8]:
df1.tail(2)

    0   1   2   3
2   8   9  10  11
3  23  45  67  89

In [9]:
ar1=np.array([[1,2,3,4],[5,6,7,8],[8,9,10,11],[23,45,67,89]])

In [10]:
ar1

array([[ 1,  2,  3,  4],
       [ 5,  6,  7,  8],
       [ 8,  9, 10, 11],
       [23, 45, 67, 89]])

In [11]:
ar1[2,3]

11

In [12]:
df1[2,2]

KeyError: (2, 2)

In [13]:
df1.shape

(4, 4)

In [14]:
df1.iloc[3,3]

89

# to acess the element iloc[indx of row,indx of column]

In [15]:
df1

    0   1   2   3
0   1   2   3   4
1   5   6   7   8
2   8   9  10  11
3  23  45  67  89

In [19]:
df1.iloc[0:2,1:3]

   1  2
0  2  3
1  6  7

# to acess the element iloc[row begin:(end+1),col begin:(end+1)]

In [30]:
 df2=pd.DataFrame([[1,2,3,4],[5,6,7,8],[8,9,10,11],[23,45,67,89]],columns=['A','B','C','D'])

In [31]:
df2

    A   B   C   D
0   1   2   3   4
1   5   6   7   8
2   8   9  10  11
3  23  45  67  89

In [32]:
df2=pd.DataFrame({"Name":['John','Camili','Rheana','Joseph','Amanti','Alexa','Siri'],"Salary":['1','2','3','4','5','6','7']})

In [33]:
df2

     Name Salary
0    John      1
1  Camili      2
2  Rheana      3
3  Joseph      4
4  Amanti      5
5   Alexa      6
6    Siri      7

In [35]:
 df3=pd.DataFrame({"class":[1,2,3,4],"Roll":[5,6,7,8],"Sec":[8,9,10,11],"Name":
                   [23,45,67,89]})

In [36]:
df3

   class  Roll  Sec  Name
0      1     5    8    23
1      2     6    9    45
2      3     7   10    67
3      4     8   11    89